In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [4]:
titanic.head()

       class     age  sex survived
0  1st class  adults  man      yes
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes

In [5]:
sobreviveu = titanic[titanic['survived'] == 'yes']

In [7]:
len(sobreviveu)

499

In [8]:
sobreviveu_h = sobreviveu[
    sobreviveu['sex'] == 'man'
]

In [9]:
len(sobreviveu_h)

175

In [12]:
sobreviveu_menino = sobreviveu_h[
    sobreviveu_h['age'] == 'child'
]

In [13]:
len(sobreviveu_menino)

29

In [15]:
sobreviveu_menino = titanic[
    (titanic['survived'] == 'yes') & 
    (titanic['age'] == 'child') & 
    (titanic['sex'] == 'man')
]

In [16]:
len(sobreviveu_menino)

29